#!/usr/bin/env python
# coding: utf-8

# #### 텀프로젝트 최종 보고서 _ 2018100727 이경준

# # 수도권 지하철 이용 승객 수 데이터 분석 

# ###  (1) 주제 선정 이유:
#  서울시 및 경기도에서는 부산, 전라남도 광주와는 다르게 지하철 이용이 활성화 되어있다. 그리고, 강남역, 홍대입구역 등 유동인구가 많은 지역이 주로 서울 지역에 몰려있는데, 경기도와 서울의 지하철 이용자 수는 얼마나 차이가 나며, 서울 내에서도 각각의 지하철역들 사이에 얼마만큼의 차이가 나는지 궁금하여 데이터를 통해 자세히 알아보고자 하였다.

# ### (2) 가설 정의
# 서울에 위치한 지하철역의 이용자 수가 경기도에 위치한 지하철역의 이용자 수보다 더 많을 것이다. 그리고, 서울의 많은 지하철역들 사이에서도 분명히 이용자 수 차이가 존재할 것이다.

# ### (3) 인터넷을 통한 데이터 획득
# 서울시 열린 데이터 광장 웹사이트에서(http://data.seoul.go.kr/dataList/OA-12914/S/1/datasetView.do) csv 파일 형식으로 월별 지하철 승하차 정보를 제공하고 있다. 이중 나는 10월 한달 동안의 데이터를 나타내는 csv 파일을 다운로드하여 데이터 획득을 하였다. csv 파일 이름은 'CARD_SUBWAY_MONTH_202210' 이다.

# ### (4) 분석을 위한 데이터의 가공
# csv 파일을 살펴보니 사용일자, 노선명, 역명, 승차 총승객, 하차 총승객, 등록일자 순으로 데이터를 나타내었다. 서울 지역에서는 광화문역, 강남역, 홍대 입구역, 명동역의 이용자 수를 알고자 하였으며, 경기도 지역에서는 범계역, 수원역, 영통역, 의왕역의 이용자 수를 알고자 했다. 또한, 승차, 하차 구분 없이 해당 역의 이용자 수를 알고자 하는 것이기 때문에 승차 총승객과 하차 총승객을 더하여 일별 이용자 수를 구하였다. 그렇게 각 지하철역별로 한달간 총 이용자 수를 구하였으며, 월 화 수 목 금 토 일 요일별로도 평균 이용자 수가 어떻게 되는지 알아보았다. <br> 
# 데이터 분석의 세부적인 것을 간단히 이야기 하자면, csv 파일에 있는 데이터를 모두 fileMatrix 의 리스트에 정리하여 넣었으며, 각 역에 해당하는 정보를 다시 또 다른 리스트를 생성하여 넣고 데이터 분석을 했다.<br>
# 그리고, 서울에 위치한 4개의 역 각각의 요일별 평균 이용자 수를 구할 때 2022년 10월 1일이 무슨 요일인지 알아야 했다. 알아본 결과, 2022년 10월 1일은 토요일이었고, 10월 31일은 월요일이었다.

# ### (5) 분석 결과 도출
# <br> 아래는 결과를 print 함수를 통해 간단히 나타낸 것이다.<br>
# <br>Total users who used GwangWhaMoon station for a month are 1936807
# <br>Total users who used GangNam station for a month are 4317062
# <br>Total users who used HongDae station for a month are 1725050
# <br>Total users who used MyeongDong station for a month are 1612883
# <br>Total users who used BeomGye station for a month are 1576408
# <br>Total users who used SuWon station for a month are 1457540
# <br>Total users who used YeongTong station for a month are 522126
# <br>Total users who used UiWang station for a month are 524825
# <br>Gwangwha users of each day: [17051, 23132, 24733, 24844, 25712, 15244, 8491]
# <br>Gangnam users of each day: [39241, 55865, 55647, 56278, 60467, 31288, 17420]
# <br>Hongdae users of each day: [25419, 33369, 10682, 8538, 30416, 7983, 6757]
# <br>Myeongdong users of each day: [13149, 18375, 19293, 19549, 20536, 15208, 10771]
# 
# <br> matplotlib를 통해 시각화 작업을 하였는데, 이는 python 소스코드 원본에 포함해 두어 따로 해당 자료를 가져오지는 않았다.

# ### (6) 결론
# 히스토그램을 통해 각 지하철역의 한달 동안 이용한 총 이용자 수를 시각화 하였는데, 강남역이 이용자 수가 가장 많고 의왕역과 영통역의 이용자 수가 가장 적은 쪽에 속한다는 결론을 도출하였다. 이때, 서울에 위치한 지하철역의 이용자 수가 경기도에 위치한 범계역, 수원역보다 훨씬 많을 것으로 예상했는데, 그렇지 않다는 것을 깨달았다. <br>또한, 서울 지하철역에서의 요일별 평균 이용자 수도 그래프를 통해 시각화해 보았는데, 금요일에 대체적으로 이용자수가 가장 많은 것을 확인할 수 있었다. 다만, 홍대입구역의 경우 화요일에 평균 이용자 수가 가장 많았는데, 이는 예외 사례로 생각하려고 한다.<br>

# ### (7) 참고문헌
# matplotlib 이용 - https://wikidocs.net/92071 
# <br> 실습 자료 이용

# ### (8) 별첨 : (3)의 획득한 데이터 원본
# 
# csv 파일이 포함하고 있는 정보가 커서 파일 첨부만 해서 제출하였습니다.

# ### (9) 별첨: (4)의 가공된 데이터 원본
# 
# 가공된 데이터 원본은 csv 파일 형태로 생성하였으며, 아래는 이를 복사한 자료입니다. <br><br>
# 사용일자	노선명	역명	승차 총승객	하차 총승객	등록일자	
# 						
# "20221001"	"5호선"	"광화문(세종문화회관)"	"23921"	"23676"	"20221004"	""
# 						
# "20221002"	"5호선"	"광화문(세종문화회관)"	"18188"	"17283"	"20221005"	""
# 						
# "20221003"	"5호선"	"광화문(세종문화회관)"	"25966"	"27242"	"20221006"	""
# 						
# "20221004"	"5호선"	"광화문(세종문화회관)"	"33534"	"35059"	"20221007"	""
# 						
# "20221005"	"5호선"	"광화문(세종문화회관)"	"37741"	"39629"	"20221008"	""
# 						
# "20221006"	"5호선"	"광화문(세종문화회관)"	"35626"	"37425"	"20221009"	""
# 						
# "20221007"	"5호선"	"광화문(세종문화회관)"	"37424"	"39527"	"20221010"	""
# 						
# "20221008"	"5호선"	"광화문(세종문화회관)"	"29201"	"28063"	"20221011"	""
# 						
# "20221009"	"5호선"	"광화문(세종문화회관)"	"17076"	"17382"	"20221012"	""
# 						
# "20221010"	"5호선"	"광화문(세종문화회관)"	"23046"	"23310"	"20221013"	""
# 						
# "20221011"	"5호선"	"광화문(세종문화회관)"	"34822"	"36715"	"20221014"	""
# 						
# "20221012"	"5호선"	"광화문(세종문화회관)"	"36851"	"38192"	"20221015"	""
# 						
# "20221013"	"5호선"	"광화문(세종문화회관)"	"36771"	"38633"	"20221016"	""
# 						
# "20221014"	"5호선"	"광화문(세종문화회관)"	"35844"	"37875"	"20221017"	""
# 						
# "20221015"	"5호선"	"광화문(세종문화회관)"	"25792"	"25475"	"20221018"	""
# 						
# "20221016"	"5호선"	"광화문(세종문화회관)"	"16235"	"15802"	"20221019"	""
# 						
# "20221017"	"5호선"	"광화문(세종문화회관)"	"33866"	"31370"	"20221020"	""
# 						
# "20221018"	"5호선"	"광화문(세종문화회관)"	"34623"	"35345"	"20221021"	""
# 						
# "20221019"	"5호선"	"광화문(세종문화회관)"	"36019"	"38357"	"20221022"	""
# 						
# "20221020"	"5호선"	"광화문(세종문화회관)"	"36058"	"38107"	"20221023"	""
# 						
# "20221021"	"5호선"	"광화문(세종문화회관)"	"37504"	"39263"	"20221024"	""
# 						
# "20221022"	"5호선"	"광화문(세종문화회관)"	"31388"	"33371"	"20221025"	""
# 						
# "20221023"	"5호선"	"광화문(세종문화회관)"	"17459"	"16886"	"20221026"	""
# 						
# "20221024"	"5호선"	"광화문(세종문화회관)"	"33117"	"34685"	"20221027"	""
# 						
# "20221025"	"5호선"	"광화문(세종문화회관)"	"34379"	"35118"	"20221028"	""
# 						
# "20221026"	"5호선"	"광화문(세종문화회관)"	"36327"	"38112"	"20221029"	""
# 						
# "20221027"	"5호선"	"광화문(세종문화회관)"	"36736"	"38246"	"20221030"	""
# 						
# "20221028"	"5호선"	"광화문(세종문화회관)"	"37973"	"39877"	"20221031"	""
# 						
# "20221029"	"5호선"	"광화문(세종문화회관)"	"29622"	"31065"	"20221101"	""
# 						
# "20221030"	"5호선"	"광화문(세종문화회관)"	"17095"	"16880"	"20221102"	""
# 						
# "20221031"	"5호선"	"광화문(세종문화회관)"	"33611"	"35022"	"20221103"	""
# 						
# "20221001"	"2호선"	"강남"	"58374"	"58877"	"20221004"	""
# 						
# "20221002"	"2호선"	"강남"	"36721"	"36591"	"20221005"	""
# 						
# "20221003"	"2호선"	"강남"	"30192"	"29053"	"20221006"	""
# 						
# "20221004"	"2호선"	"강남"	"84057"	"81384"	"20221007"	""
# 						
# "20221005"	"2호선"	"강남"	"86317"	"83360"	"20221008"	""
# 						
# "20221006"	"2호선"	"강남"	"87747"	"84654"	"20221009"	""
# 						
# "20221007"	"2호선"	"강남"	"93385"	"92171"	"20221010"	""
# 						
# "20221008"	"2호선"	"강남"	"60050"	"60129"	"20221011"	""
# 						
# "20221009"	"2호선"	"강남"	"34302"	"34233"	"20221012"	""
# 						
# "20221010"	"2호선"	"강남"	"35743"	"34488"	"20221013"	""
# 						
# "20221011"	"2호선"	"강남"	"84385"	"81412"	"20221014"	""
# 						
# "20221012"	"2호선"	"강남"	"85370"	"82250"	"20221015"	""
# 						
# "20221013"	"2호선"	"강남"	"86509"	"83742"	"20221016"	""
# 						
# "20221014"	"2호선"	"강남"	"91148"	"89826"	"20221017"	""
# 						
# "20221015"	"2호선"	"강남"	"60818"	"60772"	"20221018"	""
# 						
# "20221016"	"2호선"	"강남"	"34385"	"33049"	"20221019"	""
# 						
# "20221017"	"2호선"	"강남"	"82718"	"79979"	"20221020"	""
# 						
# "20221018"	"2호선"	"강남"	"85710"	"82544"	"20221021"	""
# 						
# "20221019"	"2호선"	"강남"	"84873"	"79642"	"20221022"	""
# 						
# "20221020"	"2호선"	"강남"	"85930"	"82926"	"20221023"	""
# 						
# "20221021"	"2호선"	"강남"	"90659"	"90025"	"20221024"	""
# 						
# "20221022"	"2호선"	"강남"	"61669"	"62662"	"20221025"	""
# 						
# "20221023"	"2호선"	"강남"	"35186"	"33713"	"20221026"	""
# 						
# "20221024"	"2호선"	"강남"	"82761"	"79641"	"20221027"	""
# 						
# "20221025"	"2호선"	"강남"	"86204"	"82248"	"20221028"	""
# 						
# "20221026"	"2호선"	"강남"	"85789"	"82544"	"20221029"	""
# 						
# "20221027"	"2호선"	"강남"	"86413"	"83154"	"20221030"	""
# 						
# "20221028"	"2호선"	"강남"	"91725"	"90765"	"20221031"	""
# 						
# "20221029"	"2호선"	"강남"	"61621"	"63943"	"20221101"	""
# 						
# "20221030"	"2호선"	"강남"	"36245"	"33716"	"20221102"	""
# 						
# "20221031"	"2호선"	"강남"	"79691"	"76872"	"20221103"	""
# 						
# "20221001"	"2호선"	"홍대입구"	"72912"	"82760"	"20221004"	""
# 						
# "20221001"	"공항철도 1호선"	"홍대입구"	"14970"	"15465"	"20221004"	""
# 						
# "20221001"	"경의선"	"홍대입구"	"2303"	"2985"	"20221004"	""
# 						
# "20221002"	"경의선"	"홍대입구"	"1834"	"2517"	"20221005"	""
# 						
# "20221002"	"공항철도 1호선"	"홍대입구"	"12487"	"12491"	"20221005"	""
# 						
# "20221002"	"2호선"	"홍대입구"	"60525"	"63592"	"20221005"	""
# 						
# "20221003"	"2호선"	"홍대입구"	"46517"	"45268"	"20221006"	""
# 						
# "20221003"	"경의선"	"홍대입구"	"1210"	"1631"	"20221006"	""
# 						
# "20221003"	"공항철도 1호선"	"홍대입구"	"9887"	"9346"	"20221006"	""
# 						
# "20221004"	"2호선"	"홍대입구"	"57362"	"60413"	"20221007"	""
# 						
# "20221004"	"공항철도 1호선"	"홍대입구"	"10710"	"11140"	"20221007"	""
# 						
# "20221004"	"경의선"	"홍대입구"	"1863"	"2214"	"20221007"	""
# 						
# "20221005"	"경의선"	"홍대입구"	"2003"	"2361"	"20221008"	""
# 						
# "20221005"	"2호선"	"홍대입구"	"60363"	"63588"	"20221008"	""
# 						
# "20221005"	"공항철도 1호선"	"홍대입구"	"11122"	"11445"	"20221008"	""
# 						
# "20221006"	"2호선"	"홍대입구"	"61038"	"65735"	"20221009"	""
# 						
# "20221006"	"경의선"	"홍대입구"	"2053"	"2434"	"20221009"	""
# 						
# "20221006"	"공항철도 1호선"	"홍대입구"	"11526"	"11743"	"20221009"	""
# 						
# "20221007"	"2호선"	"홍대입구"	"71077"	"80895"	"20221010"	""
# 						
# "20221007"	"공항철도 1호선"	"홍대입구"	"13730"	"14370"	"20221010"	""
# 						
# "20221007"	"경의선"	"홍대입구"	"2296"	"2953"	"20221010"	""
# 						
# "20221008"	"2호선"	"홍대입구"	"81131"	"93317"	"20221011"	""
# 						
# "20221008"	"공항철도 1호선"	"홍대입구"	"17025"	"17021"	"20221011"	""
# 						
# "20221008"	"경의선"	"홍대입구"	"2826"	"4037"	"20221011"	""
# 						
# "20221009"	"2호선"	"홍대입구"	"61902"	"64325"	"20221012"	""
# 						
# "20221009"	"경의선"	"홍대입구"	"1721"	"2369"	"20221012"	""
# 						
# "20221009"	"공항철도 1호선"	"홍대입구"	"12555"	"12361"	"20221012"	""
# 						
# "20221010"	"2호선"	"홍대입구"	"55596"	"55575"	"20221013"	""
# 						
# "20221010"	"경의선"	"홍대입구"	"1692"	"2161"	"20221013"	""
# 						
# "20221010"	"공항철도 1호선"	"홍대입구"	"11210"	"10497"	"20221013"	""
# 						
# "20221011"	"2호선"	"홍대입구"	"60584"	"64011"	"20221014"	""
# 						
# "20221001"	"4호선"	"명동"	"21543"	"25534"	"20221004"	""
# 						
# "20221002"	"4호선"	"명동"	"18266"	"20274"	"20221005"	""
# 						
# "20221003"	"4호선"	"명동"	"13085"	"12869"	"20221006"	""
# 						
# "20221004"	"4호선"	"명동"	"24641"	"25166"	"20221007"	""
# 						
# "20221005"	"4호선"	"명동"	"26400"	"27348"	"20221008"	""
# 						
# "20221006"	"4호선"	"명동"	"25732"	"26953"	"20221009"	""
# 						
# "20221007"	"4호선"	"명동"	"28237"	"30119"	"20221010"	""
# 						
# "20221008"	"4호선"	"명동"	"25401"	"29338"	"20221011"	""
# 						
# "20221009"	"4호선"	"명동"	"18769"	"20828"	"20221012"	""
# 						
# "20221010"	"4호선"	"명동"	"17064"	"17550"	"20221013"	""
# 						
# "20221011"	"4호선"	"명동"	"26847"	"27571"	"20221014"	""
# 						
# "20221012"	"4호선"	"명동"	"27821"	"29136"	"20221015"	""
# 						
# "20221013"	"4호선"	"명동"	"28336"	"29575"	"20221016"	""
# 						
# "20221014"	"4호선"	"명동"	"29149"	"30809"	"20221017"	""
# 						
# "20221015"	"4호선"	"명동"	"23743"	"26751"	"20221018"	""
# 						
# "20221016"	"4호선"	"명동"	"18787"	"21236"	"20221019"	""
# 						
# "20221017"	"4호선"	"명동"	"27776"	"28254"	"20221020"	""
# 						
# "20221018"	"4호선"	"명동"	"27857"	"28759"	"20221021"	""
# 						
# "20221019"	"4호선"	"명동"	"27787"	"29387"	"20221022"	""
# 						
# "20221020"	"4호선"	"명동"	"28034"	"29481"	"20221023"	""
# 						
# "20221021"	"4호선"	"명동"	"29714"	"31857"	"20221024"	""
# 						
# "20221022"	"4호선"	"명동"	"28115"	"30639"	"20221025"	""
# 						
# "20221023"	"4호선"	"명동"	"20285"	"22062"	"20221026"	""
# 						
# "20221024"	"4호선"	"명동"	"27639"	"28022"	"20221027"	""
# 						
# "20221025"	"4호선"	"명동"	"27826"	"27341"	"20221028"	""
# 						
# "20221026"	"4호선"	"명동"	"28685"	"29795"	"20221029"	""
# 						
# "20221027"	"4호선"	"명동"	"29046"	"30329"	"20221030"	""
# 						
# "20221028"	"4호선"	"명동"	"30098"	"31997"	"20221031"	""
# 						
# "20221029"	"4호선"	"명동"	"29456"	"32301"	"20221101"	""
# 						
# "20221030"	"4호선"	"명동"	"20737"	"22672"	"20221102"	""
# 						
# "20221031"	"4호선"	"명동"	"25555"	"26499"	"20221103"	""
# 						
# "20221001"	"과천선"	"범계"	"22326"	"22007"	"20221004"	""
# 						
# "20221002"	"과천선"	"범계"	"16612"	"16457"	"20221005"	""
# 						
# "20221003"	"과천선"	"범계"	"13336"	"13125"	"20221006"	""
# 						
# "20221004"	"과천선"	"범계"	"27817"	"28147"	"20221007"	""
# 						
# "20221005"	"과천선"	"범계"	"28614"	"29073"	"20221008"	""
# 						
# "20221006"	"과천선"	"범계"	"29132"	"29594"	"20221009"	""
# 						
# "20221007"	"과천선"	"범계"	"31421"	"32547"	"20221010"	""
# 						
# "20221008"	"과천선"	"범계"	"24632"	"23903"	"20221011"	""
# 						
# "20221009"	"과천선"	"범계"	"15360"	"15532"	"20221012"	""
# 						
# "20221010"	"과천선"	"범계"	"15600"	"15309"	"20221013"	""
# 						
# "20221011"	"과천선"	"범계"	"28301"	"28718"	"20221014"	""
# 						
# "20221012"	"과천선"	"범계"	"28700"	"29072"	"20221015"	""
# 						
# "20221013"	"과천선"	"범계"	"29206"	"29448"	"20221016"	""
# 						
# "20221014"	"과천선"	"범계"	"30445"	"31387"	"20221017"	""
# 						
# "20221015"	"과천선"	"범계"	"24113"	"23847"	"20221018"	""
# 						
# "20221016"	"과천선"	"범계"	"16517"	"16037"	"20221019"	""
# 						
# "20221017"	"과천선"	"범계"	"27198"	"27385"	"20221020"	""
# 						
# "20221018"	"과천선"	"범계"	"28819"	"29047"	"20221021"	""
# 						
# "20221019"	"과천선"	"범계"	"28914"	"29200"	"20221022"	""
# 						
# "20221020"	"과천선"	"범계"	"30088"	"30529"	"20221023"	""
# 						
# "20221021"	"과천선"	"범계"	"31854"	"32916"	"20221024"	""
# 						
# "20221022"	"과천선"	"범계"	"24120"	"23698"	"20221025"	""
# 						
# "20221023"	"과천선"	"범계"	"17110"	"16492"	"20221026"	""
# 						
# "20221024"	"과천선"	"범계"	"27697"	"27949"	"20221027"	""
# 						
# "20221025"	"과천선"	"범계"	"28757"	"31163"	"20221028"	""
# 						
# "20221026"	"과천선"	"범계"	"29204"	"29900"	"20221029"	""
# 						
# "20221027"	"과천선"	"범계"	"28655"	"28923"	"20221030"	""
# 						
# "20221028"	"과천선"	"범계"	"31222"	"32615"	"20221031"	""
# 						
# "20221029"	"과천선"	"범계"	"24441"	"24105"	"20221101"	""
# 						
# "20221030"	"과천선"	"범계"	"16522"	"16098"	"20221102"	""
# 						
# "20221031"	"과천선"	"범계"	"27627"	"27825"	"20221103"	""
# 						
# "20221001"	"분당선"	"수원"	"8385"	"7408"	"20221004"	""
# 						
# "20221001"	"경부선"	"수원"	"42789"	"47237"	"20221004"	""
# 						
# "20221002"	"경부선"	"수원"	"37513"	"38088"	"20221005"	""
# 						
# "20221002"	"분당선"	"수원"	"6678"	"5918"	"20221005"	""
# 						
# "20221003"	"분당선"	"수원"	"5290"	"4681"	"20221006"	""
# 						
# "20221003"	"경부선"	"수원"	"31832"	"30525"	"20221006"	""
# 						
# "20221004"	"분당선"	"수원"	"8605"	"7462"	"20221007"	""
# 						
# "20221004"	"경부선"	"수원"	"38411"	"40541"	"20221007"	""
# 						
# "20221005"	"경부선"	"수원"	"39002"	"41217"	"20221008"	""
# 						
# "20221005"	"분당선"	"수원"	"8971"	"7742"	"20221008"	""
# 						
# "20221006"	"경부선"	"수원"	"39788"	"42122"	"20221009"	""
# 						
# "20221006"	"분당선"	"수원"	"8999"	"7706"	"20221009"	""
# 						
# "20221007"	"경부선"	"수원"	"43596"	"47619"	"20221010"	""
# 						
# "20221007"	"분당선"	"수원"	"9645"	"8809"	"20221010"	""
# 						
# "20221008"	"분당선"	"수원"	"8297"	"7352"	"20221011"	""
# 						
# "20221008"	"경부선"	"수원"	"45688"	"51022"	"20221011"	""
# 						
# "20221009"	"경부선"	"수원"	"36547"	"35936"	"20221012"	""
# 						
# "20221009"	"분당선"	"수원"	"6542"	"5531"	"20221012"	""
# 						
# "20221010"	"경부선"	"수원"	"34283"	"32864"	"20221013"	""
# 						
# "20221010"	"분당선"	"수원"	"5784"	"4996"	"20221013"	""
# 						
# "20221011"	"경부선"	"수원"	"39811"	"41589"	"20221014"	""
# 						
# "20221011"	"분당선"	"수원"	"8749"	"7695"	"20221014"	""
# 						
# "20221012"	"분당선"	"수원"	"8713"	"7730"	"20221015"	""
# 						
# "20221012"	"경부선"	"수원"	"38585"	"41143"	"20221015"	""
# 						
# "20221013"	"경부선"	"수원"	"39311"	"41952"	"20221016"	""
# 						
# "20221013"	"분당선"	"수원"	"9249"	"7838"	"20221016"	""
# 						
# "20221014"	"분당선"	"수원"	"9628"	"8503"	"20221017"	""
# 						
# "20221014"	"경부선"	"수원"	"42007"	"45834"	"20221017"	""
# 						
# "20221015"	"분당선"	"수원"	"8400"	"7121"	"20221018"	""
# 						
# "20221015"	"경부선"	"수원"	"43000"	"47202"	"20221018"	""
# 						
# "20221016"	"분당선"	"수원"	"6381"	"5678"	"20221019"	""
# 						
# "20221001"	"분당선"	"영통"	"7888"	"7422"	"20221004"	""
# 						
# "20221002"	"분당선"	"영통"	"5502"	"5554"	"20221005"	""
# 						
# "20221003"	"분당선"	"영통"	"4541"	"4859"	"20221006"	""
# 						
# "20221004"	"분당선"	"영통"	"9494"	"9775"	"20221007"	""
# 						
# "20221005"	"분당선"	"영통"	"9735"	"9911"	"20221008"	""
# 						
# "20221006"	"분당선"	"영통"	"9792"	"9908"	"20221009"	""
# 						
# "20221007"	"분당선"	"영통"	"10656"	"10467"	"20221010"	""
# 						
# "20221008"	"분당선"	"영통"	"7633"	"7393"	"20221011"	""
# 						
# "20221009"	"분당선"	"영통"	"4946"	"5070"	"20221012"	""
# 						
# "20221010"	"분당선"	"영통"	"4762"	"5015"	"20221013"	""
# 						
# "20221011"	"분당선"	"영통"	"9401"	"9914"	"20221014"	""
# 						
# "20221012"	"분당선"	"영통"	"9545"	"9635"	"20221015"	""
# 						
# "20221013"	"분당선"	"영통"	"10191"	"10176"	"20221016"	""
# 						
# "20221014"	"분당선"	"영통"	"10247"	"10465"	"20221017"	""
# 						
# "20221015"	"분당선"	"영통"	"7724"	"7436"	"20221018"	""
# 						
# "20221016"	"분당선"	"영통"	"5602"	"5598"	"20221019"	""
# 						
# "20221017"	"분당선"	"영통"	"9196"	"9512"	"20221020"	""
# 						
# "20221018"	"분당선"	"영통"	"9250"	"9354"	"20221021"	""
# 						
# "20221019"	"분당선"	"영통"	"9520"	"9481"	"20221022"	""
# 						
# "20221020"	"분당선"	"영통"	"9657"	"9629"	"20221023"	""
# 						
# "20221021"	"분당선"	"영통"	"10103"	"10079"	"20221024"	""
# 						
# "20221022"	"분당선"	"영통"	"7850"	"7878"	"20221025"	""
# 						
# "20221023"	"분당선"	"영통"	"5271"	"5179"	"20221026"	""
# 						
# "20221024"	"분당선"	"영통"	"9106"	"9389"	"20221027"	""
# 						
# "20221025"	"분당선"	"영통"	"9367"	"9582"	"20221028"	""
# 						
# "20221026"	"분당선"	"영통"	"9740"	"9709"	"20221029"	""
# 						
# "20221027"	"분당선"	"영통"	"9936"	"9967"	"20221030"	""
# 						
# "20221028"	"분당선"	"영통"	"10700"	"10682"	"20221031"	""
# 						
# "20221029"	"분당선"	"영통"	"7998"	"7789"	"20221101"	""
# 						
# "20221030"	"분당선"	"영통"	"5552"	"5737"	"20221102"	""
# 						
# "20221031"	"분당선"	"영통"	"9247"	"9409"	"20221103"	""
# 						
# "20221001"	"경부선"	"의왕"	"6578"	"6235"	"20221004"	""
# 						
# "20221002"	"경부선"	"의왕"	"4666"	"4536"	"20221005"	""
# 						
# "20221003"	"경부선"	"의왕"	"3856"	"4014"	"20221006"	""
# 						
# "20221004"	"경부선"	"의왕"	"9778"	"9900"	"20221007"	""
# 						
# "20221005"	"경부선"	"의왕"	"10408"	"10166"	"20221008"	""
# 						
# "20221006"	"경부선"	"의왕"	"10275"	"10149"	"20221009"	""
# 						
# "20221007"	"경부선"	"의왕"	"10671"	"10586"	"20221010"	""
# 						
# "20221008"	"경부선"	"의왕"	"7072"	"6701"	"20221011"	""
# 						
# "20221009"	"경부선"	"의왕"	"4173"	"4056"	"20221012"	""
# 						
# "20221010"	"경부선"	"의왕"	"4531"	"4605"	"20221013"	""
# 						
# "20221011"	"경부선"	"의왕"	"10072"	"10004"	"20221014"	""
# 						
# "20221012"	"경부선"	"의왕"	"10348"	"10157"	"20221015"	""
# 						
# "20221013"	"경부선"	"의왕"	"11065"	"10969"	"20221016"	""
# 						
# "20221014"	"경부선"	"의왕"	"10563"	"10333"	"20221017"	""
# 						
# "20221015"	"경부선"	"의왕"	"6893"	"6626"	"20221018"	""
# 						
# "20221016"	"경부선"	"의왕"	"4845"	"4889"	"20221019"	""
# 						
# "20221017"	"경부선"	"의왕"	"10204"	"10166"	"20221020"	""
# 						
# "20221018"	"경부선"	"의왕"	"10480"	"10410"	"20221021"	""
# 						
# "20221019"	"경부선"	"의왕"	"10274"	"10289"	"20221022"	""
# 						
# "20221020"	"경부선"	"의왕"	"10442"	"10403"	"20221023"	""
# 						
# "20221021"	"경부선"	"의왕"	"10601"	"10241"	"20221024"	""
# 						
# "20221022"	"경부선"	"의왕"	"7149"	"6985"	"20221025"	""
# 						
# "20221023"	"경부선"	"의왕"	"5005"	"5032"	"20221026"	""
# 						
# "20221024"	"경부선"	"의왕"	"10042"	"9991"	"20221027"	""
# 						
# "20221025"	"경부선"	"의왕"	"10514"	"10403"	"20221028"	""
# 						
# "20221026"	"경부선"	"의왕"	"10394"	"10238"	"20221029"	""
# 						
# "20221027"	"경부선"	"의왕"	"10544"	"10408"	"20221030"	""
# 						
# "20221028"	"경부선"	"의왕"	"10737"	"10408"	"20221031"	""
# 						
# "20221029"	"경부선"	"의왕"	"7159"	"6839"	"20221101"	""
# 						
# "20221030"	"경부선"	"의왕"	"4711"	"4853"	"20221102"	""
# 						
# "20221031"	"경부선"	"의왕"	"10110"	"10073"	"20221103"	""
# ![image.png](attachment:image.png)

# ### (10) 별첨: (3)을 (4)로 변환하는 등의 작업을 위하여 본인이 직접 개발한 Python 소스코드 원본

# In[1]:


class info:
    def __init__(self):
        self.fileMatrix=[]
    def make_list(self, filename):
        with open(filename,'r',encoding='UTF8') as file:
            for line in file:
                self.fileMatrix.append(line.strip('\n').split(','))
        
filelist=info()
filelist.make_list('CARD_SUBWAY_MONTH_202210.csv')
length=len(filelist.fileMatrix)

Gwangwha=[]
for i in range(length):
    if filelist.fileMatrix[i][2]=='"광화문(세종문화회관)"':
        Gwangwha.append(filelist.fileMatrix[i])
    else:
        continue

Gangnam=[]
for i in range(length):
    if filelist.fileMatrix[i][2]=='"강남"':
        Gangnam.append(filelist.fileMatrix[i])
    else:
        continue
        
Hongdae=[]
for i in range(length):
    if filelist.fileMatrix[i][2]=='"홍대입구"':
        Hongdae.append(filelist.fileMatrix[i])
    else:
        continue
        
Myeongdong=[]
for i in range(length):
    if filelist.fileMatrix[i][2]=='"명동"':
        Myeongdong.append(filelist.fileMatrix[i])
    else:
        continue

Gwangwha_people=0
Gangnam_people=0
Hongdae_people=0
Myeongdong_people=0

def read(station_name,station_users):
    sentence="Total users who used "+station_name+" station for a month are "+str(station_users)
    return sentence

        
for i in range(31):
    Gwangwha_people=Gwangwha_people+int(Gwangwha[i][3].replace('"',''))+int(Gwangwha[i][4].replace('"',''))
    Gangnam_people=Gangnam_people+int(Gangnam[i][3].replace('"',''))+int(Gangnam[i][4].replace('"',''))
    Hongdae_people=Hongdae_people+int(Hongdae[i][3].replace('"',''))+int(Hongdae[i][4].replace('"',''))
    Myeongdong_people=Myeongdong_people+int(Myeongdong[i][3].replace('"',''))+int(Myeongdong[i][4].replace('"',''))

print(read("GwangWhaMoon",Gwangwha_people))
print(read("GangNam",Gangnam_people))
print(read("Hongdae",Hongdae_people))
print(read("Myeongdong",Myeongdong_people))


Beomgye=[]
Suwon=[]
Yeongtong=[]
Uiwang=[]

for i in range(length):
    if filelist.fileMatrix[i][2]=='"범계"':
        Beomgye.append(filelist.fileMatrix[i])
    elif filelist.fileMatrix[i][2]=='"수원"':
        Suwon.append(filelist.fileMatrix[i])
    elif filelist.fileMatrix[i][2]=='"영통"':
        Yeongtong.append(filelist.fileMatrix[i])
    elif filelist.fileMatrix[i][2]=='"의왕"':
        Uiwang.append(filelist.fileMatrix[i])
    else:
        continue

class calculate:
    def __init__(self):
        self.people=0
        self.i=0
        self.monday=0
        self.tuesday=0
        self.wednesday=0
        self.thursday=0
        self.friday=0
        self.saturday=0
        self.sunday=0
    
    def calculate_people(self,list):
        while self.i<31:
            self.people=self.people+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
            self.i=self.i+1
        return self.people
    
    def calculate_average(self,list):
        for self.i in range(len(list)):
            if self.i in [2,9,16,23,30]:
                self.monday=self.monday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.monday=int(self.monday/5)
            elif self.i in [3,10,17,24]:
                self.tuesday=self.tuesday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.tuesday=int(self.tuesday/4)
            elif self.i in [4,11,18,25]:
                self.wednesday=self.wednesday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.wednesday=int(self.wednesday/4)
            elif self.i in [5,12,19,26]:
                self.thursday=self.thursday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.thursday=int(self.thursday/4)
            elif self.i in [6,13,20,27]:
                self.friday=self.friday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.friday=int(self.friday/4)
            elif self.i in [0,7,14,21,28]:
                self.saturday=self.saturday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.saturday=int(self.saturday/5)
            elif self.i in [1,8,15,22,29]:
                self.sunday=self.sunday+int(list[self.i][3].replace('"',''))+int(list[self.i][4].replace('"',''))
                self.sunday=int(self.sunday/5)
        return [self.monday, self.tuesday, self.wednesday, self.thursday, self.friday, self.saturday, self.sunday]

    
Beomgye_f=calculate()
Beomgye_people=Beomgye_f.calculate_people(Beomgye)

Suwon_f=calculate()
Suwon_people=Suwon_f.calculate_people(Suwon)

Yeongtong_f=calculate()
Yeongtong_people=Yeongtong_f.calculate_people(Yeongtong)

Uiwang_f=calculate()
Uiwang_people=Uiwang_f.calculate_people(Uiwang)

print("Total users who used BeomGye station for a month are {}"
      .format(Beomgye_people))
print("Total users who used SuWon station for a month are {}"
      .format(Suwon_people))
print("Total users who used YeongTong station for a month are {}"
      .format(Yeongtong_people))
print("Total users who used UiWang station for a month are {}"
      .format(Uiwang_people))

Gwangwha_f=calculate()
Gangnam_f=calculate()
Hongdae_f=calculate()
Myeongdong_f=calculate()

print('Gwangwha users of each day:',Gwangwha_f.calculate_average(Gwangwha))
print('Gangnam users of each day:',Gangnam_f.calculate_average(Gangnam))
print('Hongdae users of each day:',Hongdae_f.calculate_average(Hongdae))
print('Myeongdong users of each day:',Myeongdong_f.calculate_average(Myeongdong))


import csv
with open('new_station_file.csv','w') as write:
    newwrite=csv.writer(write)
    newwrite.writerow(['사용일자', '노선명', '역명', '승차 총승객', '하차 총승객'
                      , '등록일자'])
    for i in range(31):
        newwrite.writerow(Gwangwha[i])
    for i in range(31):
        newwrite.writerow(Gangnam[i])
    for i in range(31):
        newwrite.writerow(Hongdae[i])
    for i in range(31):
        newwrite.writerow(Myeongdong[i])
    for i in range(31):
        newwrite.writerow(Beomgye[i])
    for i in range(31):
        newwrite.writerow(Suwon[i])
    for i in range(31):
        newwrite.writerow(Yeongtong[i])
    for i in range(31):
        newwrite.writerow(Uiwang[i])

        
import matplotlib.pyplot as plt
import numpy as np

day=range(7)
plt.xticks(day,['Monday','Tuesday','Wednesday','Thursday','Friday','Saturday','Sunday']
          ,rotation=45)
plt.plot(day, Gwangwha_f.calculate_average(Gwangwha),'o--',label='Gwangwha',color='cyan')
plt.plot(day, Gangnam_f.calculate_average(Gangnam),'o--',label='Gangnam',color='springgreen')
plt.plot(day, Hongdae_f.calculate_average(Hongdae),'o--',label='Hongdae',color='violet')
plt.plot(day, Myeongdong_f.calculate_average(Myeongdong),'o--',label='Myeongdong',color='orange')
plt.xlabel('Day',fontsize=12)
plt.ylabel('Number of People',fontsize=12)
plt.title('Number of People using Subway each day', fontsize=15,fontweight='bold'
         ,pad=20)
plt.legend()
plt.show()

x = np.arange(8)

years = ['Gwangwha', 'Gangnam','Hongdae','Myeongdong','Beomgye','Suwon','Uiwang',
         'Yeongtong']
values = [Gwangwha_people, Gangnam_people, Hongdae_people, Myeongdong_people,
         Beomgye_people, Suwon_people, Uiwang_people, Yeongtong_people]

plt.bar(x, values, width=0.5, color ='green',alpha=0.5)
plt.xticks(x, years, rotation= 45)
plt.xlabel('Station',fontsize=15)
plt.ylabel('Number of people',fontsize=15)
plt.title('Total Users of Each Station', fontsize=20,pad=20,fontweight='bold')

plt.show()


# In[ ]:




